function/README.md
```mermaid
flowchart TD
  scheduler["Cloud Scheduler"] -- Runs once a day --> cron["CronUpdateShops"]

  cron --> queue1["QueueSaveShop"]
  cron --> queue2["QueueSaveShop"]
  cron --> queue3["QueueSaveShop"]

  queue1 --> firestore[(Cloud Firestore)]
  queue2 --> firestore
  queue3 --> firestore
```
